
###################################
# 리스트를 이용해서 반의 평균을 구하는 프로그램을 작성하시오.
# 학생수를 입력 받는다. 단, 학급의 최소 학생수는 최소 4이상이다.
# 입력 받은 학생 수 만큼의 학생의 성적을 입력 받는다.
# 3번째의 학생의 성적을 100 점으로 바꾸시오.
# 마지막 학생은 삭제하시오.
# 그리고 합계와 평균을 구하여 출력한다.
#
#
# 작업 순서
# . 학생수 입력 받기. 최소 4명이상
# . 학생 성적 입력 받기. 몇 번 입력 받아야 하는가?
# . 3번 학생의 성적을 100점으로 바꾸시오.
# . list에서 마지막 학생 삭제.
# . list에서 첫번째 값을 출력하시오.
# . 평균을 구하고 출력.
#
#
# 실행결과예시
# 학생수를 입력하시오 : 4
# 성적을 입력하시오: 35
# 성적을 입력하시오: 45
# 성적을 입력하시오: 55
# 성적을 입력하시오: 35
# 합계는: 135
# 평균은: 38.33
#
###################################
