# py02_01_변수선언

# 변수란 변하는 값이다.    ==> 수학
# 변수란 메모리 공간이다.  ==> 프로그래밍


# 변수 초기화 = 변수 선언과 변수 대입
# False . 불린.
# 문자열. 문자배열. 큰따옴표
# 정수.
# 실수.
b = True
c = "a"
i = 7
d = 0.05


# 변수 출력
print( "b: ", b)
print( "c: ", c)
print( "i: ", i)
print( "d: ", d)


# 변수 수정
# False . 불린.
# 문자열. 문자배열. 큰따옴표
# 정수.
# 실수.
b = False
c = "A"
i = 100
d = 20.17

# 변수 출력
print( "b: ", b)
print( "c: ", c)
print( "i: ", i)
print( "d: ", d)



# 키보드 입력 --> 변수 --> 모니터 출력
# 마우스 입력 --> 변수 --> 모니터 출력
# 스캐너 입력 --> 변수 --> 모니터 출력


# 키보드 입력 --> 변수 --> 모니터 출력
# 키보드 입력 --> 변수 --> 파일 출력
# 키보드 입력 --> 변수 --> 프린터 출력
